In [2]:
import pandas as pd
from surprise import SVD, KNNBaseline

from CF.CFModel import CFModel
from CF.CFData import CFData
from CF.CFMovieSystem import CFMovieSystem


_df_movie = pd.read_csv('./data/movies.csv')
_df_rating = pd.read_csv('./data/ratings.csv')

_df_data = _df_rating[['userId', 'movieId', 'rating']]
_df_id_name_table = _df_movie[['movieId', 'title']]

In [3]:
_movie_data = _df_data.merge(_df_id_name_table, on='movieId')

_movie_data.head()

   userId  movieId  rating             title
0       1        1     4.0  Toy Story (1995)
1       5        1     4.0  Toy Story (1995)
2       7        1     4.5  Toy Story (1995)
3      15        1     2.5  Toy Story (1995)
4      17        1     4.5  Toy Story (1995)

In [78]:
movie_count = pd.DataFrame(_movie_data.groupby(['movieId', 'title'])['rating'].mean())

movie_count['count'] = pd.DataFrame(_movie_data.groupby(['movieId', 'title'])['rating'].count())

a = 50

# movie_count = movie_count[movie_count['count']>a].sort_values(by='count', ascending=False)

movie_count = movie_count[movie_count['count']>a]

movie_count.head()

                                   rating  count
movieId title
1       Toy Story (1995)         3.920930    215
2       Jumanji (1995)           3.431818    110
3       Grumpier Old Men (1995)  3.259615     52
6       Heat (1995)              3.946078    102
7       Sabrina (1995)           3.185185     54

In [64]:
movie_count.iloc[435].name[1]

"The Devil's Advocate (1997)"

In [76]:
movie_count.shape[0]

436

In [40]:
dic['1'] = 'asda'
dic

{'1': 'asda'}

In [75]:
import random

dict = {}
selected_rows = random.sample(range(435), 15)

for i in selected_rows:
      row = movie_count.iloc[i]
      id = row.name[0]
      title = row.name[1]
      dict[title] = id
    
dict

{'Goonies, The (1985)': 2005,
 'Italian Job, The (2003)': 6378,
 'Space Jam (1996)': 673,
 'Dogma (1999)': 3052,
 'Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan (2006)': 48385,
 'Inception (2010)': 79132,
 'Crocodile Dundee (1986)': 2470,
 'Sin City (2005)': 32587,
 'Best in Show (2000)': 3911,
 "Mr. Holland's Opus (1995)": 62,
 'Babe (1995)': 34,
 'Bad Boys (1995)': 145,
 'Clockwork Orange, A (1971)': 1206,
 'Batman Forever (1995)': 153,
 "Ocean's Eleven (2001)": 4963}

In [81]:
links = pd.read_csv('./data/links.csv')

links.describe()

             movieId        imdbId         tmdbId
count    9742.000000  9.742000e+03    9734.000000
mean    42200.353623  6.771839e+05   55162.123793
std     52160.494854  1.107228e+06   93653.481487
min         1.000000  4.170000e+02       2.000000
25%      3248.250000  9.518075e+04    9665.500000
50%      7300.000000  1.672605e+05   16529.000000
75%     76232.000000  8.055685e+05   44205.750000
max    193609.000000  8.391976e+06  525662.000000

In [90]:
links[links['movieId']==100].iloc[0]['imdbId']

115907.0

In [88]:
'tt:{:07}'.format(109254.0)

'tt:0109254'

In [91]:
a = [1,2,3,4]

a[0]

1

In [92]:
a = []
if a:
    print(1)
else:
    print(2)

2

In [94]:
a = {'id': 1, 'posters': [{'width':200}]}

if a['posters']:
    print(1)
    print(a['posters'][0])
else:
    print(2)

1
{'width': 200}

In [95]:
len(a['posters'])

1

In [98]:
tags = pd.read_csv('./data/tags.csv')

tags.head(20)

    userId  movieId                tag   timestamp
0        2    60756              funny  1445714994
1        2    60756    Highly quotable  1445714996
2        2    60756       will ferrell  1445714992
3        2    89774       Boxing story  1445715207
4        2    89774                MMA  1445715200
5        2    89774          Tom Hardy  1445715205
6        2   106782              drugs  1445715054
7        2   106782  Leonardo DiCaprio  1445715051
8        2   106782    Martin Scorsese  1445715056
9        7    48516       way too long  1169687325
10      18      431          Al Pacino  1462138765
11      18      431           gangster  1462138749
12      18      431              mafia  1462138755
13      18     1221          Al Pacino  1461699306
14      18     1221              Mafia  1461699303
15      18     5995          holocaust  1455735472
16      18     5995         true story  1455735479
17      18    44665       twist ending  1456948283
18      18    52604    Anthony Hopkins  1457650696
19      18    52604    courtroom drama  1457650711

            userId        movieId     timestamp
count  3683.000000    3683.000000  3.683000e+03
mean    431.149335   27252.013576  1.320032e+09
std     158.472553   43490.558803  1.721025e+08
min       2.000000       1.000000  1.137179e+09
25%     424.000000    1262.500000  1.137521e+09
50%     474.000000    4454.000000  1.269833e+09
75%     477.000000   39263.000000  1.498457e+09
max     610.000000  193565.000000  1.537099e+09

In [108]:
float('123')

123.0

In [105]:
int(' (12')

ValueError: invalid literal for int() with base 10: ' (12'

In [110]:
d = { 'a':1, 'b':2 }
for i in d:
    print(i, d[i])

a 1
b 2

In [113]:
d = [1,2,3,4]
d[-3:]

[2, 3, 4]

In [121]:
def fn(a, c, k=1):
    print(a,c,k)

fn(1,2,3)
fn(1,k=2,c=2)

1 2 3
1 2 2